Cyberdom123/quadcopter-dsp/firmware/fc-stm32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "dma.h"
#include "i2c.h"
#include "spi.h"
#include "tim.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
//#include "usbd_cdc_if.h"
#include "string.h"
#include <drivers/nrf24l01.h>
#include <drivers/mpu6050.h>
#include <drivers/motors.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
NRF24L01_STRUCT nrf24l01;
MPU6050_STRUCT mpu;

/* Declare buffers */
uint8_t command[8];
union Telemetry {
  FLOAT_TYPE floatingPoint[6];
  uint8_t bytes[24];
} telemetry;

FLOAT_TYPE acc_buff[3];
FLOAT_TYPE gyro_buff[3];

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi) {
  if(nrf24l01.payloadFlag){
    NRF24L01_Read_PayloadDMA_Complete(&nrf24l01, command, 8);
    Motors_Run(command);
    HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_12);
    NRF24L01_Start_Listening(&nrf24l01);
  }

}

void HAL_I2C_MemRxCpltCallback(I2C_HandleTypeDef *hi2c){
  if(mpu.gyro_busy && mpu.acc_busy){
    MPU_read_acc_gyro_DMA_complete(&mpu);
    for (size_t i = 0; i < 3; i++)
    {
      telemetry.floatingPoint[i] = acc_buff[i];
    }
    for (size_t i = 0; i < 3; i++)
    {
      telemetry.floatingPoint[3+i] = acc_buff[i];
    }
    
  }
  else if(mpu.gyro_busy){
    MPU_read_gyro_DMA_complete(&mpu);
  }
  else if(mpu.acc_busy){
    MPU_read_acc_DMA_complete(&mpu);
  }
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin){
  if(GPIO_Pin == NRF_INT_Pin){
    NRF24L01_Stop_Listening(&nrf24l01);
    NRF24L01_Write_ACKN_Payload(&nrf24l01, telemetry.bytes, 24);
    NRF24L01_Read_PayloadDMA(&nrf24l01, 8);
  }
  if(GPIO_Pin == MPU_INT_Pin){
    MPU_read_acc_gyro_DMA(&mpu);
  }
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_SPI1_Init();
  MX_TIM1_Init();
  MX_I2C1_Init();
  MX_TIM2_Init();
  /* USER CODE BEGIN 2 */
  HAL_Delay(1000);
  
  /* Initialize IO buffers */
  mpu.mpu_acc_buff = acc_buff;
  mpu.mpu_gyro_buff = gyro_buff;
 
  /* Initialize mpu */
  mpu.hi2c = &hi2c1;
  MPU6050_config mpu_cfg = MPU_get_default_cfg();
  MPU_init(&mpu, &mpu_cfg);

  /* Initialize nrf24l01 */
  nrf24l01.nrf24l01GpioPort = CE_GPIO_Port;
  nrf24l01.csnPin = CSN_Pin;
  nrf24l01.cePin = CE_Pin;
  nrf24l01.spiHandle = &hspi1;

  NRF24L01_Init(&nrf24l01, &nrf24l01_default_config);
  
  NRF24L01_Enable_ACKN_Payload(&nrf24l01);
  uint64_t rx_addr_pipe = 0xc2c2c2c2c2LL;
  NRF24L01_Open_Reading_Pipe(&nrf24l01, RX_ADDR_P1, rx_addr_pipe, 8);
  
  NRF24L01_Get_Info(&nrf24l01);
  NRF24L01_Start_Listening(&nrf24l01);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

  } 
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  /* USER CODE END 3 */
} 

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
